musicapp/app/models/user.rb

    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!
---
INSERT INTO "users" ("session_token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["session_token", "YZJvohjxaqnw-x9TBuLTZg"], ["created_at", "2021-04-06 19:09:59.468044"], ["updated_at", "2021-04-06 19:09:59.468044"]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "z4YSgiGT3XaNYrMcX5-i6Q"], ["updated_at", "2021-04-06 19:14:42.065764"], ["id", 5]]